# RebarConstrainedHandle Properties

---
The RebarConstrainedHandle type exposes the following members.
| Name| Description
---|---|---
| HandleBehavior|  Identifies the handle behavior.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace